In [1]:
import pandas as pd
import numpy as np

In [2]:
df=pd.read_csv('./Details.csv')

In [4]:
df.isnull().sum()

Order ID        0
Amount          0
Profit          0
Quantity        0
Category        0
Sub-Category    0
PaymentMode     0
dtype: int64

In [5]:
df.isnull().any()

Order ID        False
Amount          False
Profit          False
Quantity        False
Category        False
Sub-Category    False
PaymentMode     False
dtype: bool

In [6]:
df_filled=df.fillna(method='ffill')

C:\Users\efte2\AppData\Local\Temp\ipykernel_22300\114162365.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df_filled=df.fillna(method='ffill')

In [7]:
df.dtypes

Order ID        object
Amount           int64
Profit           int64
Quantity         int64
Category        object
Sub-Category    object
PaymentMode     object
dtype: object

In [8]:
df=df.rename(columns={'Amount':'Price'})

In [11]:
df['Quantity']=df['Profit'].apply(lambda x:x**2)

In [12]:
df.head()

,Order ID,Price,Profit,Quantity,Category,Sub-Category,PaymentMode
0,B-25681,1096,658,432964,Electronics,Electronic Games,COD
1,B-26055,5729,64,4096,Furniture,Chairs,EMI
2,B-25955,2927,146,21316,Furniture,Bookcases,EMI
3,B-26093,2847,712,506944,Electronics,Printers,Credit Card
4,B-25602,2617,1151,1324801,Electronics,Phones,Credit Card

In [13]:
grouped_mean=df.groupby('Category')['Price'].mean()

In [15]:
grouped_mean

Category
Clothing       152.079031
Electronics    539.827922
Furniture      523.378601
Name: Price, dtype: float64

In [17]:
grouped_mean=df.groupby(['Category','Sub-Category'])['Price'].mean()

In [18]:
grouped_mean

Category     Sub-Category
Clothing     Hankerchief           72.558376
             Kurti                 71.510638
             Leggings              39.735849
             Saree                280.066351
             Shirt                109.492754
             Skirt                 30.406250
             Stole                 96.593750
             T-shirt               95.870130
             Trousers             770.230769
Electronics  Accessories          301.777778
             Electronic Games     495.797468
             Phones               555.650602
             Printers             800.702703
Furniture    Bookcases            719.759494
             Chairs               462.459459
             Furnishings          184.712329
             Tables              1330.235294
Name: Price, dtype: float64

In [19]:
grouped_agg=df.groupby(['Category','Sub-Category']).agg({'Price':'mean','Quantity':'sum'})

In [20]:
grouped_agg

                                    Price  Quantity
Category    Sub-Category
Clothing    Hankerchief         72.558376    203391
            Kurti               71.510638     48689
            Leggings            39.735849     13278
            Saree              280.066351   3183971
            Shirt              109.492754    140501
            Skirt               30.406250     37035
            Stole               96.593750    275741
            T-shirt             95.870130    100030
            Trousers           770.230769   2087525
Electronics Accessories        301.777778   1528495
            Electronic Games   495.797468   3744866
            Phones             555.650602   6924943
            Printers           800.702703   7333216
Furniture   Bookcases          719.759494   9536262
            Chairs             462.459459   1970027
            Furnishings        184.712329    491048
            Tables            1330.235294   5881521

In [31]:
df1=pd.DataFrame({
    'key':['A','B','C','F'],
    'value':[1,2,3,4]
    
})

In [32]:
df2=pd.DataFrame({
    'key':['A','B','C','E'],
    'value':[5,6,7,8]
})

In [33]:
x=pd.merge(df1, df2, on='key',how='inner')

In [34]:
x

  key  value_x  value_y
0   A        1        5
1   B        2        6
2   C        3        7

In [35]:
y=pd.merge(df1, df2, on='key',how='outer')

In [36]:
y

  key  value_x  value_y
0   A      1.0      5.0
1   B      2.0      6.0
2   C      3.0      7.0
3   E      NaN      8.0
4   F      4.0      NaN

In [37]:
z=pd.merge(df1, df2, on='key',how='left')

In [38]:
z

  key  value_x  value_y
0   A        1      5.0
1   B        2      6.0
2   C        3      7.0
3   F        4      NaN

In [39]:
a=pd.merge(df1, df2, on='key',how='right')

In [40]:
a

  key  value_x  value_y
0   A      1.0        5
1   B      2.0        6
2   C      3.0        7
3   E      NaN        8

In [44]:
x='abcfef3'

x.isalpha()

False

In [68]:
def consonant(letter):
    x= "aeiou"
    return (letter.isalpha() and letter.islower()) and letter not in x

In [69]:
x='a'

In [70]:
consonant('b')

True